```Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.d-sn-pri1-abc-020-a will be created
  + resource "aws_subnet" "d-sn-pri1-abc-020-a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"     = "d-sn-pri-abc-sre-a"
          + "SystemID" = "ABC"
        }
      + tags_all                                       = {
          + "Name"     = "d-sn-pri-abc-sre-a"
          + "SystemID" = "ABC"
        }
      + vpc_id                                         = "vpc-023907f6fffd9b645"
    }

  # aws_subnet.d-sn-pri1-abc-020-c will be created
  + resource "aws_subnet" "d-sn-pri1-abc-020-c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"     = "d-sn-pri-abc-sre-c"
          + "SystemID" = "ABC"
        }
      + tags_all                                       = {
          + "Name"     = "d-sn-pri-abc-sre-c"
          + "SystemID" = "ABC"
        }
      + vpc_id                                         = "vpc-023907f6fffd9b645"
    }

  # aws_subnet.d-sn-pri2-abc-030-a will be created
  + resource "aws_subnet" "d-sn-pri2-abc-030-a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"     = "d-sn-pri-abc-sre-a"
          + "SystemID" = "ABC"
        }
      + tags_all                                       = {
          + "Name"     = "d-sn-pri-abc-sre-a"
          + "SystemID" = "ABC"
        }
      + vpc_id                                         = "vpc-023907f6fffd9b645"
    }

  # aws_subnet.d-sn-pri2-abc-030-c will be created
  + resource "aws_subnet" "d-sn-pri2-abc-030-c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"     = "d-sn-pri-abc-sre-c"
          + "SystemID" = "ABC"
        }
      + tags_all                                       = {
          + "Name"     = "d-sn-pri-abc-sre-c"
          + "SystemID" = "ABC"
        }
      + vpc_id                                         = "vpc-023907f6fffd9b645"
    }

  # aws_subnet.d-sn-pub-abc-010-a will be created
  + resource "aws_subnet" "d-sn-pub-abc-010-a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"     = "d-sn-pub-abc-sre-a"
          + "SystemID" = "ABC"
        }
      + tags_all                                       = {
          + "Name"     = "d-sn-pub-abc-sre-a"
          + "SystemID" = "ABC"
        }
      + vpc_id                                         = "vpc-023907f6fffd9b645"
    }

  # aws_subnet.d-sn-pub-abc-010-c will be created
  + resource "aws_subnet" "d-sn-pub-abc-010-c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"     = "d-sn-pub-abc-sre-c"
          + "SystemID" = "ABC"
        }
      + tags_all                                       = {
          + "Name"     = "d-sn-pub-abc-sre-c"
          + "SystemID" = "ABC"
        }
      + vpc_id                                         = "vpc-023907f6fffd9b645"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```